In [1]:
#initialize dictionary with data 

employee={
    "name":['robert','steve','vijay','ajith','vijay'],
    "age":['20','22','22','25','30'],
    "Id":['100','101','102','103','104'],
    "salary":['75k','55k','39k','37k','60k']
}

In [2]:
#dictionary displays data as a list

employee['age']

['20', '22', '22', '25', '30']

In [3]:
#Import pandas
import pandas as pd

In [4]:
df=pd.DataFrame(employee)

In [5]:
df

     name age   Id salary
0  robert  20  100    75k
1   steve  22  101    55k
2   vijay  22  102    39k
3   ajith  25  103    37k
4   vijay  30  104    60k

In [6]:
#data frame displays data with index values

df['salary']

0    75k
1    55k
2    39k
3    37k
4    60k
Name: salary, dtype: object

In [7]:
#pandas is a container of series object and each column value is series type

type(df['salary'])

pandas.core.series.Series

In [8]:
#loc to access data with values

df.loc[[0,1],['name','salary']]

     name salary
0  robert    75k
1   steve    55k

In [9]:
#iloc is used to access ata with index value

df.iloc[[1,2],[0,3]]

    name salary
1  steve    55k
2  vijay    39k

In [10]:
#index change

df.set_index('Id',inplace=True)

#set index changes the index as required column

In [11]:
df

       name age salary
Id
100  robert  20    75k
101   steve  22    55k
102   vijay  22    39k
103   ajith  25    37k
104   vijay  30    60k

In [12]:
#loc using index column

df.loc[['100'],['name','salary']]

       name salary
Id
100  robert    75k

In [13]:
df.index

Index(['100', '101', '102', '103', '104'], dtype='object', name='Id')

In [14]:
df.iloc[0]

name      robert
age           20
salary       75k
Name: 100, dtype: object

In [15]:
df.iloc[[2,3],[0,1]]

      name age
Id
102  vijay  22
103  ajith  25

In [16]:
#slicing with iloc

df.iloc[2:3,0:1]

      name
Id
102  vijay

In [17]:
#slicing with loc

df.loc['100':'103','name':'salary']

       name age salary
Id
100  robert  20    75k
101   steve  22    55k
102   vijay  22    39k
103   ajith  25    37k

In [18]:
#To reset index

df.reset_index(inplace=True)

In [19]:
df

    Id    name age salary
0  100  robert  20    75k
1  101   steve  22    55k
2  102   vijay  22    39k
3  103   ajith  25    37k
4  104   vijay  30    60k

In [20]:
#Filter data
#gives true or false for condition

df['name'] =='vijay'

0    False
1    False
2     True
3    False
4     True
Name: name, dtype: bool

In [21]:
filt=df['name'] =='vijay'

In [22]:
#using filt in df will give the true values

df[filt]

    Id   name age salary
2  102  vijay  22    39k
4  104  vijay  30    60k

In [23]:
#to get required columns in filter data

df.loc[filt,['age','salary']]

  age salary
2  22    39k
4  30    60k

In [24]:
filt=(df['name'] =='vijay') & (df['age'] =='22')

In [25]:
df.loc[filt,'salary']

2    39k
Name: salary, dtype: object

In [26]:
filt=(df['name'] =='vijay') | (df['age'] =='25')

In [27]:
df[filt]

    Id   name age salary
2  102  vijay  22    39k
3  103  ajith  25    37k
4  104  vijay  30    60k

In [28]:
#To change the columns name
df.columns

Index(['Id', 'name', 'age', 'salary'], dtype='object')

In [29]:
df.columns=['empid','name','age','salary']

In [30]:
df

  empid    name age salary
0   100  robert  20    75k
1   101   steve  22    55k
2   102   vijay  22    39k
3   103   ajith  25    37k
4   104   vijay  30    60k

In [31]:
df.columns=[x.upper() for x in df.columns]

In [32]:
df

  EMPID    NAME AGE SALARY
0   100  robert  20    75k
1   101   steve  22    55k
2   102   vijay  22    39k
3   103   ajith  25    37k
4   104   vijay  30    60k

In [33]:
#to change the name for specific column
df.rename(columns={'EMPID':'id'},inplace=True)

In [34]:
df

    id    NAME AGE SALARY
0  100  robert  20    75k
1  101   steve  22    55k
2  102   vijay  22    39k
3  103   ajith  25    37k
4  104   vijay  30    60k

In [35]:
df.columns=[x.lower() for x in df.columns]

In [36]:
df

    id    name age salary
0  100  robert  20    75k
1  101   steve  22    55k
2  102   vijay  22    39k
3  103   ajith  25    37k
4  104   vijay  30    60k

In [37]:
#To upate values using index

df.loc[2,['name']]=['vikram']

In [38]:
df

    id    name age salary
0  100  robert  20    75k
1  101   steve  22    55k
2  102  vikram  22    39k
3  103   ajith  25    37k
4  104   vijay  30    60k

In [39]:
#To upate values using filter

filt=(df['name']=='vikram')&(df['age']=='22')

In [40]:
df.loc[filt,'name']='vijay'

In [41]:
df

    id    name age salary
0  100  robert  20    75k
1  101   steve  22    55k
2  102   vijay  22    39k
3  103   ajith  25    37k
4  104   vijay  30    60k

In [42]:
#To upper case name values
df['name']=df['name'].str.upper()

In [43]:
df

    id    name age salary
0  100  ROBERT  20    75k
1  101   STEVE  22    55k
2  102   VIJAY  22    39k
3  103   AJITH  25    37k
4  104   VIJAY  30    60k

In [44]:
#usage of apply

df['name'].apply(len)

0    6
1    5
2    5
3    5
4    5
Name: name, dtype: int64

In [45]:
def update_name(name):
    return name.lower()

In [46]:
df['name'].apply(update_name)

0    robert
1     steve
2     vijay
3     ajith
4     vijay
Name: name, dtype: object

In [47]:
#Diff b/w Apply len and len

len(df['name'])

5

In [48]:
df.apply(pd.Series.min)

id          100
name      AJITH
age          20
salary      37k
dtype: object

In [49]:
df.apply(len)

id        5
name      5
age       5
salary    5
dtype: int64

In [50]:
# Diff b/w apply an applymap

df.applymap(len)

   id  name  age  salary
0   3     6    2       3
1   3     5    2       3
2   3     5    2       3
3   3     5    2       3
4   3     5    2       3

In [51]:
df=df.applymap(str.lower)

df

    id    name age salary
0  100  robert  20    75k
1  101   steve  22    55k
2  102   vijay  22    39k
3  103   ajith  25    37k
4  104   vijay  30    60k

In [52]:
#Replace is used to replace specific values

df['name'] = df['name'].replace({'vijay': 'hulk', 'ajith': 'scarlet'})

In [53]:
df

    id     name age salary
0  100   robert  20    75k
1  101    steve  22    55k
2  102     hulk  22    39k
3  103  scarlet  25    37k
4  104     hulk  30    60k

In [54]:
df['email']=df['name'] + df['age'] +'@gmail.com'

In [55]:
df

    id     name age salary                email
0  100   robert  20    75k   robert20@gmail.com
1  101    steve  22    55k    steve22@gmail.com
2  102     hulk  22    39k     hulk22@gmail.com
3  103  scarlet  25    37k  scarlet25@gmail.com
4  104     hulk  30    60k     hulk30@gmail.com

In [56]:
#to append data

df.append({'id':'105','name':'tony'},ignore_index=True)

C:\Users\Venkatesh\AppData\Local\Temp\ipykernel_13716\127640737.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append({'id':'105','name':'tony'},ignore_index=True)

    id     name  age salary                email
0  100   robert   20    75k   robert20@gmail.com
1  101    steve   22    55k    steve22@gmail.com
2  102     hulk   22    39k     hulk22@gmail.com
3  103  scarlet   25    37k  scarlet25@gmail.com
4  104     hulk   30    60k     hulk30@gmail.com
5  105     tony  NaN    NaN                  NaN

In [57]:
#initialize dictionary with data 

employee2={
    "name":['thomas','strange','mike'],
    "age":['30','23','29'],
    "id":['106','107','108'],
    "salary":['75k','55k','39k']
}

df2=pd.DataFrame(employee2)

In [58]:
df2

      name age   id salary
0   thomas  30  106    75k
1  strange  23  107    55k
2     mike  29  108    39k

In [59]:
df=df.append(df2,ignore_index=True)

C:\Users\Venkatesh\AppData\Local\Temp\ipykernel_13716\2482205262.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df=df.append(df2,ignore_index=True)

In [60]:
df

    id     name age salary                email
0  100   robert  20    75k   robert20@gmail.com
1  101    steve  22    55k    steve22@gmail.com
2  102     hulk  22    39k     hulk22@gmail.com
3  103  scarlet  25    37k  scarlet25@gmail.com
4  104     hulk  30    60k     hulk30@gmail.com
5  106   thomas  30    75k                  NaN
6  107  strange  23    55k                  NaN
7  108     mike  29    39k                  NaN

In [61]:
#To drop rows and columns

df.drop(index=4)

    id     name age salary                email
0  100   robert  20    75k   robert20@gmail.com
1  101    steve  22    55k    steve22@gmail.com
2  102     hulk  22    39k     hulk22@gmail.com
3  103  scarlet  25    37k  scarlet25@gmail.com
5  106   thomas  30    75k                  NaN
6  107  strange  23    55k                  NaN
7  108     mike  29    39k                  NaN

In [62]:
#To drop rows with filter
filt=(df['name']=='hulk')&(df['age']=='22')
df=df.drop(index=df[filt].index)

In [63]:
df

    id     name age salary                email
0  100   robert  20    75k   robert20@gmail.com
1  101    steve  22    55k    steve22@gmail.com
3  103  scarlet  25    37k  scarlet25@gmail.com
4  104     hulk  30    60k     hulk30@gmail.com
5  106   thomas  30    75k                  NaN
6  107  strange  23    55k                  NaN
7  108     mike  29    39k                  NaN

In [64]:
#sorting

df.sort_values(by=['name', 'age'], ascending=[True, False], inplace=True)

In [65]:
df

    id     name age salary                email
4  104     hulk  30    60k     hulk30@gmail.com
7  108     mike  29    39k                  NaN
0  100   robert  20    75k   robert20@gmail.com
3  103  scarlet  25    37k  scarlet25@gmail.com
1  101    steve  22    55k    steve22@gmail.com
6  107  strange  23    55k                  NaN
5  106   thomas  30    75k                  NaN

In [66]:
# Data cleaning

In [67]:
import pandas as pd
import numpy as np

In [68]:
people = {
    'first': ['tony', 'cap', 'green', 'bat', np.nan, None, 'NA'], 
    'last': ['stark', 'amer', 'hulk', 'man', np.nan, np.nan, 'Missing'], 
    'email': ['tonystark@gmail.com', 'capamer@email.com', 'greenhulk@email.com', None, np.nan, 'mansteel@email.com', 'NA'],
    'age': ['30', '55', '63', '36', None, None, 'Missing']
}
df3=pd.DataFrame(people)

In [69]:
df3

   first     last                email      age
0   tony    stark  tonystark@gmail.com       30
1    cap     amer    capamer@email.com       55
2  green     hulk  greenhulk@email.com       63
3    bat      man                 None       36
4    NaN      NaN                  NaN     None
5   None      NaN   mansteel@email.com     None
6     NA  Missing                   NA  Missing

In [70]:
#To check null values
df3.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6  False  False  False  False

In [71]:
#to drop null values

df3.dropna()

   first     last                email      age
0   tony    stark  tonystark@gmail.com       30
1    cap     amer    capamer@email.com       55
2  green     hulk  greenhulk@email.com       63
6     NA  Missing                   NA  Missing

In [72]:
df3.dropna(axis='index', how='all')

   first     last                email      age
0   tony    stark  tonystark@gmail.com       30
1    cap     amer    capamer@email.com       55
2  green     hulk  greenhulk@email.com       63
3    bat      man                 None       36
5   None      NaN   mansteel@email.com     None
6     NA  Missing                   NA  Missing

In [73]:
df3.dropna(axis='columns', how='any')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6]

In [74]:
df3.dropna(axis='columns', how='all')

   first     last                email      age
0   tony    stark  tonystark@gmail.com       30
1    cap     amer    capamer@email.com       55
2  green     hulk  greenhulk@email.com       63
3    bat      man                 None       36
4    NaN      NaN                  NaN     None
5   None      NaN   mansteel@email.com     None
6     NA  Missing                   NA  Missing

In [75]:
df3.dropna(axis='index', how='all',subset=['email','age'])

   first     last                email      age
0   tony    stark  tonystark@gmail.com       30
1    cap     amer    capamer@email.com       55
2  green     hulk  greenhulk@email.com       63
3    bat      man                 None       36
5   None      NaN   mansteel@email.com     None
6     NA  Missing                   NA  Missing

In [76]:
df3.dropna(axis='index', how='any',subset=['email','age'])

   first     last                email      age
0   tony    stark  tonystark@gmail.com       30
1    cap     amer    capamer@email.com       55
2  green     hulk  greenhulk@email.com       63
6     NA  Missing                   NA  Missing

In [77]:
#Towork with Missing and NA
df3.replace('Missing',np.nan,inplace=True)
df3.replace('NA',np.nan,inplace=True)

In [78]:
df3

   first   last                email   age
0   tony  stark  tonystark@gmail.com    30
1    cap   amer    capamer@email.com    55
2  green   hulk  greenhulk@email.com    63
3    bat    man                 None    36
4    NaN    NaN                  NaN  None
5   None    NaN   mansteel@email.com  None
6    NaN    NaN                  NaN   NaN

In [79]:
df3.fillna(0)

   first   last                email age
0   tony  stark  tonystark@gmail.com  30
1    cap   amer    capamer@email.com  55
2  green   hulk  greenhulk@email.com  63
3    bat    man                    0  36
4      0      0                    0   0
5      0      0   mansteel@email.com   0
6      0      0                    0   0

In [80]:
#To change values with mean value

df3.dtypes

first    object
last     object
email    object
age      object
dtype: object

In [83]:
df3['age'] = df3['age'].astype(float)

In [84]:
df3.dtypes

first     object
last      object
email     object
age      float64
dtype: object

In [86]:
mea=df3['age'].mean()

In [87]:
med=df3['age'].median()

In [91]:
df3['age']=df3['age'].replace(np.nan,mea)

In [92]:
df3

   first   last                email   age
0   tony  stark  tonystark@gmail.com  30.0
1    cap   amer    capamer@email.com  55.0
2  green   hulk  greenhulk@email.com  63.0
3    bat    man                 None  36.0
4    NaN    NaN                  NaN  46.0
5   None    NaN   mansteel@email.com  46.0
6    NaN    NaN                  NaN  46.0